In [3]:
##Pyber Project

# Start with the magic inline command
%matplotlib inline

# Dependencies
import matplotlib.pyplot as plt
import pandas as pd

In [5]:
# Load the files
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

In [13]:
# Load the city data into a Dataframe
city_data_df = pd.read_csv(city_data_to_load)
city_data_df.head(5)

           city  driver_count   type
0   Richardfort            38  Urban
1  Williamsstad            59  Urban
2   Port Angela            67  Urban
3    Rodneyfort            34  Urban
4   West Robert            39  Urban

In [14]:
# Load the ride data into a Dataframe
ride_data_df = pd.read_csv(ride_data_to_load)
ride_data_df.tail(5)

                 city                 date   fare        ride_id
2370      Michaelberg  2019-04-29 17:04:39  13.38  8550365057598
2371  Lake Latoyabury  2019-01-30 00:05:47  20.76  9018727594352
2372      North Jaime  2019-02-10 21:03:50  11.11  2781339863778
2373     West Heather  2019-05-07 19:22:15  44.94  4256853490277
2374       Newtonview  2019-04-25 10:20:13  55.84  9990581345298

In [16]:
### Data Inspection
## Check rows and columns for null values
## Ensure correct data types; ie. driver_count
## List data points for each type of city

In [24]:
## City Check for Null Values
#City Data
#city_data_df.count() # returns 120 values in three fields
#city_data_df.isnull().sum() # sums null values per field.  
##No Nulls found in City Data.

In [27]:
## Ensure correct data type for driver_count so we can do calculations on field
#city_data_df.dtypes # driver count in int64. so we are good for calcs.
#ride_data_df.dtypes # ride data looks correct. Date treated as object\string

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [31]:
## List data points for each type of city
#  Get unique values for each field.
#city_data_df.dtypes
city_data_df["type"].unique() # uses unique() method on specific column
# we see we are dealing with Urban, Suburban and Rural types.
# our analysis requires stats by this catetory: of city "type"

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [34]:
## City Types : count of types
#sum(city_data_df["type"]=="Urban")
#sum(city_data_df["type"]=="Suburban")
#sum(city_data_df["type"]=="Rural")
## 66 Urban 36 Suburban  leaving 18 for Rural - math baby

18

In [39]:
## Inspect Ride Data Dataframe
ride_data_df.dtypes
## Check for Nulls
#ride_data_df.count() # returns 2375 values in four fields
#ride_data_df.isnull().sum() # sums null values per field.  
## No Nulls found in Ride Data.
#
## Inspect fare and ride_id fields for numerical
ride_data_df.dtypes
# ride data looks correct.fare is float 64 adn ride_id is int. Will work!

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [43]:
## Merge the DataFrame
#new_df = pd.merge(leftdf, rightdf, on=["column_leftdf", "column_rightdf"])
# In our case we join on city. 
# It is a left join since we want all ride data plus matching city data
pyber_data_df=pd.merge(ride_data_df, city_data_df, how="left", on=["city","city"])
#plus quick inspection of the new DF
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban